In [7]:
import pandas as pd

**Load Data**

In [8]:
dataset=pd.read_csv("daily_water_consumption.csv")

**Data exploration**

In [24]:
dataset.head(10)

,Date,Person_ID,Age,Gender,City,Temperature_C,Activity_Level,Water_Consumed_Liters
0,2025-01-01,P0001,21,Female,Karachi,22.1,Medium,2.40
1,2025-01-02,P0001,21,Female,Karachi,41.0,Medium,3.31
2,2025-01-03,P0001,21,Female,Karachi,26.4,High,2.96
3,2025-01-04,P0001,21,Female,Karachi,31.4,Medium,3.16
4,2025-01-05,P0001,21,Female,Karachi,35.7,Low,2.43
5,2025-01-06,P0001,21,Female,Karachi,33.2,Low,2.53
6,2025-01-07,P0001,21,Female,Karachi,24.8,Medium,2.66
7,2025-01-08,P0001,21,Female,Karachi,39.1,High,3.75
8,2025-01-09,P0001,21,Female,Karachi,32.4,High,3.26
9,2025-01-10,P0001,21,Female,Karachi,15.4,Medium,2.40

In [25]:
dataset.tail(7)

,Date,Person_ID,Age,Gender,City,Temperature_C,Activity_Level,Water_Consumed_Liters
36493,2025-12-25,P0100,55,Male,Rawalpindi,21.0,Low,1.83
36494,2025-12-26,P0100,55,Male,Rawalpindi,34.6,Medium,2.98
36495,2025-12-27,P0100,55,Male,Rawalpindi,22.7,Medium,2.49
36496,2025-12-28,P0100,55,Male,Rawalpindi,39.3,High,3.54
36497,2025-12-29,P0100,55,Male,Rawalpindi,40.6,Low,2.93
36498,2025-12-30,P0100,55,Male,Rawalpindi,34.1,Low,2.23
36499,2025-12-31,P0100,55,Male,Rawalpindi,16.4,Low,1.57

In [19]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36500 entries, 0 to 36499
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Date                   36500 non-null  object
 1   Person_ID              36500 non-null  object
 2   Age                    36500 non-null  int64
 3   Gender                 36500 non-null  object
 4   City                   36500 non-null  object
 5   Temperature_C          36500 non-null  float64
 6   Activity_Level         36500 non-null  object
 7   Water_Consumed_Liters  36500 non-null  float64
dtypes: float64(2), int64(1), object(5)
memory usage: 2.2+ MB

In [11]:
print('rows: ', dataset.shape[0])

rows:  36500

In [12]:
print('columns: ', dataset.shape[1])

columns:  8

In [13]:
dataset.isnull().sum()

Date                     0
Person_ID                0
Age                      0
Gender                   0
City                     0
Temperature_C            0
Activity_Level           0
Water_Consumed_Liters    0
dtype: int64

In [15]:
dataset = dataset.fillna(dataset.mean) 
dataset = dataset.fillna(dataset.median) 
dataset = dataset.fillna(dataset.mode)

In [18]:
print(df.dtypes)

Date                      object
Person_ID                 object
Age                        int64
Gender                    object
City                      object
Temperature_C            float64
Activity_Level            object
Water_Consumed_Liters    float64
dtype: object

In [20]:
dataset.describe()

                Age  Temperature_C  Water_Consumed_Liters
count  36500.000000   36500.000000           36500.000000
mean      40.430000      28.538447               2.724002
std       13.365253       7.789702               0.550482
min       18.000000      15.000000               1.300000
25%       29.750000      21.800000               2.350000
50%       40.500000      28.600000               2.720000
75%       52.000000      35.300000               3.130000
max       64.000000      42.000000               4.170000

In [ ]:
#check duplicate
print(dataset.duplicated().sum())

0